Catalogs/ФормыСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ФормыСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.РегламентированныеОтчеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПоляФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПоляФормСтатистики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФормыСтатистики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтносительныеПериодыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНачалаГода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатистическийПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатистическиеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйАлгоритм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительныеАлгоритмыЗаполненияФормСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФормыСтатистики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура заполняет справочник ФормыСтатистики и ПоляФормСтатистики
// В качестве источника данных используется СхемаВыгрузкиXML регламентированного отчета
//
// Параметры: 
// - РегламентированныйОтчет - Справочник РегламентированныеОтчеты
// - ИмяФормы 		         - Строка, идентификатор формы регламентированного отчета, полями которой нужно заполнить справочники
//
Процедура ЗаполнитьДаннымиФормы(РегламентированныйОтчет, ИмяФормы, ИмяСхемыВыгрузки) Экспорт
	
	ФормыСтатистики 		= Справочники.ФормыСтатистики;
	ПоляФормСтатистики 		= Справочники.ПоляФормСтатистики;	
	
	ИмяОтчета = РегламентированныйОтчет.ИсточникОтчета;
	
	ТаблицаФормОтчета = Отчеты[ИмяОтчета].ТаблицаФормОтчета();
	
	ПараметрыФормы = ТаблицаФормОтчета.Найти(ИмяФормы, "ФормаОтчета");
	
	Если ПараметрыФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МакетСтруктуры  = Метаданные.Отчеты[ИмяОтчета].Макеты.Найти(ИмяСхемыВыгрузки);
	
	Если МакетСтруктуры = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НоваяФорма = ФормыСтатистики.СоздатьЭлемент();
	
	НоваяФорма.Владелец 						= РегламентированныйОтчет;
	НоваяФорма.Код 				                = СокрЛП(ИмяФормы);
	НоваяФорма.Наименование 					= РегламентированныйОтчет.Наименование 
		+ " (" + СтрЗаменить(ПараметрыФормы.ОписаниеОтчета, "Форма", "") + ")";
	
	НоваяФорма.Записать();
	
	СписокПоказателей = ИнтерфейсыВзаимодействияБРО.ПолучитьПоляФормыСтатистики(
		НоваяФорма.Владелец.ИсточникОтчета, 
		ИмяСхемыВыгрузки);
	СписокПоказателей.Колонки.Добавить("ЭлементСправочника");
	
	Для Каждого Показатель Из СписокПоказателей Цикл
		
		Если Показатель.ЭтоГруппа Тогда
			
			Если НЕ Показатель.ЕстьЭлементы Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			Запись = ПоляФормСтатистики.СоздатьГруппу();
			Запись.Владелец 			= НоваяФорма.Ссылка;
			Запись.Наименование 		= Показатель.Показатель;
			Запись.Код                  = Показатель.Показатель;
			
		Иначе
			
			Запись = ПоляФормСтатистики.СоздатьЭлемент();
			
			Запись.Владелец 			= НоваяФорма.Ссылка;
			Запись.Наименование 		= Показатель.Показатель;
			Запись.ИмяПоля 				= Показатель.ИмяПоля; 
			Запись.Код 				    = Показатель.ИмяПоля;
			Запись.НомерСтрокиОтчета 	= Показатель.НомерСтроки;
			Если ЗначениеЗаполнено(Показатель.Период) Тогда
				Запись.Период 			= Перечисления.ОтносительныеПериодыОтчетности[Показатель.Период];
			КонецЕсли;
			Запись.СНачалаГода 			= Показатель.СНачалаГода;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Показатель.Родитель) Тогда
			Запись.Родитель = Показатель.Родитель.ЭлементСправочника;		
		КонецЕсли;
		
		Запись.ОбменДанными.Загрузка = Истина;
		Запись.Записать();
		
		Показатель.ЭлементСправочника = Запись.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура сверяет состав справочника ПоляФормСтатистики с содержимым структуры выгрузки в XML
// для переданной формы статистики
//
//Параметры:
// - ФормаСтатистики - Справочник.ФормыСтатистики, форма для которой нужно провести проверку
//
// Возвращаемое значение:
// - ТаблицаЗначений, содержит ссылку на справочник ПоляФормСтатистики и код ошибки,
// 	Колонки:
// - Ссылка 					- Справочник.ПоляФормСтатистики;
// - Наименование 				- Строка;
// - СтатистическийПоказатель 	- Справочник.СтатистическиеПоказатели;
// - Период 					- Перечисление.ОтносительныеПериодыОтчетности;
// - ИмяПоля					- Строка;
// - НомерСтрокиОтчета	 		- Строка;
// - СНачалаГода 				- Булево;
// - ПоказательИзXML			- Строка;
// - НомерСтрокиИзXML			- Строка;
// - ИмяПоляИзXML				- Строка;
// - ПериодИзXML 				- Перечисление.ОтносительныеПериодыОтчетности;
// - СНачалаГодаИзXML			- Булево;
// - КодОшибки 					- Число, код ошибки принимает следующие значения:
// 		 -1 - Поле из справочника не найдено в структуре XML (Критично);
// 		 -2 - Номер строки отчета из справочника отличается от номера строки отчета из структуры XML (Критично);
// 		  0 - Ошибок нет;
//		  1 - Признак периода "С начала года" не совпадает в справочнике и структуре XML (Не критично);
// 		  2 - Период из справочника не совпадает с периодом из структуры XML (Не критично).
// 
Функция ПроверитьСоответствиеДанныхФормы(ФормаСтатистики, ИмяСхемыВыгрузки) Экспорт
	
	ТаблицаПоказателей = ИнтерфейсыВзаимодействияБРО.ПолучитьПоляФормыСтатистики(
		ФормаСтатистики.Владелец.ИсточникОтчета, 
		ИмяСхемыВыгрузки);

	ТаблицаПоказателей.Колонки.Добавить("ПериодСсылка", Тип("ПеречислениеСсылка.ОтносительныеПериодыОтчетности"));
	Для Каждого Показатель Из ТаблицаПоказателей Цикл
		Если ЗначениеЗаполнено(Показатель.Период) Тогда
			Показатель.ПериодСсылка = Перечисления.ОтносительныеПериодыОтчетности[Показатель.Период];
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПоказателей", ТаблицаПоказателей);
	Запрос.УстановитьПараметр("ФормаСтатистики", ФормаСтатистики);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПоказателей.Показатель,
	|	ВЫРАЗИТЬ(ТаблицаПоказателей.НомерСтроки КАК СТРОКА(10)) КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаПоказателей.ИмяПоля КАК СТРОКА(13)) КАК ИмяПоля,
	|	ТаблицаПоказателей.ПериодСсылка КАК Период,
	|	ТаблицаПоказателей.СНачалаГода
	|ПОМЕСТИТЬ ТаблицаПоказателей
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяПоля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоляФормСтатистики.Ссылка,
	|	ПоляФормСтатистики.ВерсияДанных,
	|	ПоляФормСтатистики.ПометкаУдаления,
	|	ПоляФормСтатистики.Предопределенный,
	|	ПоляФормСтатистики.Владелец,
	|	ПоляФормСтатистики.Родитель,
	|	ПоляФормСтатистики.Наименование,
	|	ПоляФормСтатистики.СтатистическийПоказатель,
	|	ПоляФормСтатистики.Период,
	|	ПоляФормСтатистики.ИмяПоля,
	|	ПоляФормСтатистики.НомерСтрокиОтчета,
	|	ПоляФормСтатистики.СНачалаГода,
	|	ТаблицаПоказателей.Показатель КАК ПоказательИзXML,
	|	ТаблицаПоказателей.НомерСтроки КАК НомерСтрокиИзXML,
	|	ТаблицаПоказателей.ИмяПоля КАК ИмяПоляИзXML,
	|	ТаблицаПоказателей.Период КАК ПериодИзXML,
	|	ТаблицаПоказателей.СНачалаГода КАК СНачалаГодаИзXML,
	|	ВЫБОР
	|		КОГДА ТаблицаПоказателей.ИмяПоля ЕСТЬ NULL 
	|			ТОГДА -1
	|		КОГДА ТаблицаПоказателей.НомерСтроки <> ПоляФормСтатистики.НомерСтрокиОтчета
	|			ТОГДА -2
	|		КОГДА ТаблицаПоказателей.СНачалаГода <> ПоляФормСтатистики.СНачалаГода
	|			ТОГДА 1
	|		КОГДА ТаблицаПоказателей.Период <> ПоляФормСтатистики.Период
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодОшибки
	|ПОМЕСТИТЬ ТаблицаПоказателейИКодыОшибки
	|ИЗ
	|	Справочник.ПоляФормСтатистики КАК ПоляФормСтатистики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоказателей КАК ТаблицаПоказателей
	|		ПО ПоляФормСтатистики.ИмяПоля = ТаблицаПоказателей.ИмяПоля
	|ГДЕ
	|	ПоляФормСтатистики.Владелец = &ФормаСтатистики
	|	И НЕ ПоляФормСтатистики.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоказателейИКодыОшибки.Ссылка,
	|	ТаблицаПоказателейИКодыОшибки.Наименование,
	|	ТаблицаПоказателейИКодыОшибки.СтатистическийПоказатель,
	|	ТаблицаПоказателейИКодыОшибки.Период,
	|	ТаблицаПоказателейИКодыОшибки.ИмяПоля,
	|	ТаблицаПоказателейИКодыОшибки.НомерСтрокиОтчета,
	|	ТаблицаПоказателейИКодыОшибки.СНачалаГода,
	|	ТаблицаПоказателейИКодыОшибки.ПоказательИзXML,
	|	ТаблицаПоказателейИКодыОшибки.НомерСтрокиИзXML,
	|	ТаблицаПоказателейИКодыОшибки.ИмяПоляИзXML,
	|	ТаблицаПоказателейИКодыОшибки.ПериодИзXML,
	|	ТаблицаПоказателейИКодыОшибки.СНачалаГодаИзXML,
	|	ТаблицаПоказателейИКодыОшибки.КодОшибки
	|ИЗ
	|	ТаблицаПоказателейИКодыОшибки КАК ТаблицаПоказателейИКодыОшибки
	|ГДЕ
	|	ТаблицаПоказателейИКодыОшибки.КодОшибки <> 0";
      
	Возврат Запрос.Выполнить().Выгрузить();			   
	
КонецФункции

Функция ПолучитьФормуСтатистики(ИмяОтчета, ИмяФормы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяОтчета", ИмяОтчета);
	Запрос.УстановитьПараметр("ИмяФормы",  ИмяФормы);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормыСтатистики.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФормыСтатистики КАК ФормыСтатистики
	|ГДЕ
	|	ФормыСтатистики.Код = &ИмяФормы
	|	И ФормыСтатистики.Владелец.ИсточникОтчета = &ИмяОтчета
	|	И НЕ ФормыСтатистики.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ФормыСтатистики.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция КраткоеПредставлениеФормы(ФормаСтатистики) Экспорт
	
	Возврат ИнтерфейсыВзаимодействияБРО.КраткоеПредставлениеФормы(ФормаСтатистики.Владелец);
	
КонецФункции

// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Владелец");
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
